<!--
author：MierX
github：https://github.com/MierX/StudyPhp 
create time：20.11.16 17:42
motto：有志者，事竟成
-->
<?php
// 假设，有5个灯泡需要管理，需要实现以下功能目标
// 1.可以指定任意一个灯泡的“当前状态”
// 2.可以打开指定的任意一个灯泡
// 3.可以关闭指定的任意一个灯泡

// 首先需要设定对应的5个灯泡常量
const D1 = 1;  // 对应二进制为：00000000 00000000 00000000 00000001
const D2 = 2;  // 对应二进制为：00000000 00000000 00000000 00000010
const D3 = 4;  // 对应二进制为：00000000 00000000 00000000 00000100
const D4 = 8;  // 对应二进制为：00000000 00000000 00000000 00001000
const D5 = 16; // 对应二进制为：00000000 00000000 00000000 00010000

// 然后定义变量，该变量就代表这5个灯泡的“任意组合状态”值
$state = 10; // 对应二进制为：00000000 00000000 00000000 00001010，表示D2和D4的灯泡亮

// 任务1：可以指定任意一个灯泡的“当前状态”
// 需求1.1：请输出灯泡1的状态
if (($state & D1) > 0) {
    echo "灯1是亮的<br />";
} else {
    echo "灯1是灭的<br />";
}
// 需求1.2：请输出灯泡2的状态
if (($state & D2) > 0) {
    echo "灯2是亮的<br />";
} else {
    echo "灯2是灭的<br />";
}
// 需求1.3：做一个所有灯的整体状态显示
function showAll($state)
{
    for ($i = 1; $i <= 5; ++$i) {
        $deng = 'D'.$i;
        if (($state & constant($deng)) > 0) {
            echo "灯($i)亮<br />";
        } else {
            echo "灯($i)灭<br />";
        }
    }
}
showAll(9);

// 需求2，可以打开指定的任意一个灯泡
// 也只要按照如下算法就可以打开
// $state = $state | 对应灯的常量值
// 需求2.1：请打开灯3
$state = 0;
$state = $state | D3;
showAll($state);
// 需求2.2：请打开灯5
$state = $state | D5;
showAll($state);

// 需求3，可以关闭指定的任意一个灯泡
// 也只要按照如下算法就可以关闭
// $state = $state & (~对应灯的常量值)
// 需求3.1：请关闭灯5
$state = $state & (~D5);
showAll($state);
// 需求3.2：请关闭灯3
$state = $state & (~D3);
showAll($state);